## Import necessary Libraries

In [1]:
import numpy as np
import pandas as pd

import mysql.connector as mysql
from mysql.connector import Error

## Loading CSV Files by using Pandas

In [2]:
data = pd.read_csv('../data/data.csv')

## Checking data is loaded or not using head

In [3]:
data.head(2)

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50

## Shape of the Data

In [4]:
data.shape

(7253, 14)

## Finding Null Values

In [5]:
data.isnull().sum().sum()

7628

## Replace nan with None

In [6]:
data = data.replace({np.nan: None})

In [7]:
data.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,None,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,None,12.5
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.5
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,None,6.0
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,None,17.74

## Connecting to MySQL with my credentials and Creating Database

In [8]:
try:
    conn = mysql.connect(host='localhost', user='root',
                        password='root')#give ur username, password
    if conn.is_connected():
        cursor = conn.cursor()
        # tips
        cursor.execute("CREATE DATABASE used_car;")
        print("Database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 1007 (HY000): Can't create database 'used_car'; database exists

## Creating Table data and Pushing Dataframe  information to that Table

In [9]:
data.dtypes

S.No.                 int64
Name                 object
Location             object
Year                  int64
Kilometers_Driven     int64
Fuel_Type            object
Transmission         object
Owner_Type           object
Mileage              object
Engine               object
Power                object
Seats                object
New_Price            object
Price                object
dtype: object

In [10]:
try:
    conn = mysql.connect(host='localhost', database='used_car', user='root', password='root')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)
        cursor.execute('DROP TABLE IF EXISTS data;')
        print('Creating table....')
# in the below line please pass the create table statement which you want #to create
        cursor.execute("CREATE TABLE data(S_No INT, Name VARCHAR(255), Location VARCHAR(255), Year YEAR, Kilometers_Driven INT, Fuel_Type VARCHAR(50), Transmission VARCHAR(50), Owner_Type VARCHAR(50), Mileage VARCHAR(50), Engine VARCHAR(50), Power VARCHAR(50), Seats DECIMAL(10, 2), New_Price VARCHAR(50), Price DECIMAL(10, 2))")
        print("Table is created....")
        #loop through the data frame
        for i,row in data.iterrows():
            #here %S means
            # tips.tips_data
            sql = "INSERT INTO used_car.data VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)" # how many columns are there that many %s
            cursor.execute(sql, tuple(row))
            #print("Record inserted")
            # the connection is not auto committed by default, so we must commit to save our changes
            conn.commit()
except Error as e:
            print("Error while connecting to MySQL", e)

You're connected to database:  ('used_car',)
Creating table....
Table is created....